xuos/xiuos_part/Ubiquitous/XiUOS/board/ok1052-c/third_party_driver/common/pin_mux.c
/*
 * Copyright 2017-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/**
* @file pin_mux.c
* @brief support imxrt1052-board pin configure
* @version 1.0
* @author AIIT XUOS Lab
* @date 2021-05-29
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MIMXRT1052xxxxB
package_id: MIMXRT1052DVL6B
mcu_data: ksdk2_0
processor_version: 5.0.2
board: IMXRT1050-EVKB
pin_labels:
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: BSP_LED, identifier: BSP_LED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins ( void )
{
    BOARD_InitPins();
}

void SemcPinmuxConfig ( void )
{
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_00_SEMC_DATA00,         /* GPIO_EMC_00 is configured as SEMC_DATA00 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_01_SEMC_DATA01,         /* GPIO_EMC_01 is configured as SEMC_DATA01 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_02_SEMC_DATA02,         /* GPIO_EMC_02 is configured as SEMC_DATA02 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_03_SEMC_DATA03,         /* GPIO_EMC_03 is configured as SEMC_DATA03 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_04_SEMC_DATA04,         /* GPIO_EMC_04 is configured as SEMC_DATA04 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_05_SEMC_DATA05,         /* GPIO_EMC_05 is configured as SEMC_DATA05 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_06_SEMC_DATA06,         /* GPIO_EMC_06 is configured as SEMC_DATA06 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_07_SEMC_DATA07,         /* GPIO_EMC_07 is configured as SEMC_DATA07 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_08_SEMC_DM00,           /* GPIO_EMC_08 is configured as SEMC_DM00 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_09_SEMC_ADDR00,         /* GPIO_EMC_09 is configured as SEMC_ADDR00 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_10_SEMC_ADDR01,         /* GPIO_EMC_10 is configured as SEMC_ADDR01 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_11_SEMC_ADDR02,         /* GPIO_EMC_11 is configured as SEMC_ADDR02 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_12_SEMC_ADDR03,         /* GPIO_EMC_12 is configured as SEMC_ADDR03 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_13_SEMC_ADDR04,         /* GPIO_EMC_13 is configured as SEMC_ADDR04 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_14_SEMC_ADDR05,         /* GPIO_EMC_14 is configured as SEMC_ADDR05 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_15_SEMC_ADDR06,         /* GPIO_EMC_15 is configured as SEMC_ADDR06 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_16_SEMC_ADDR07,         /* GPIO_EMC_16 is configured as SEMC_ADDR07 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_17_SEMC_ADDR08,         /* GPIO_EMC_17 is configured as SEMC_ADDR08 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_18_SEMC_ADDR09,         /* GPIO_EMC_18 is configured as SEMC_ADDR09 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_19_SEMC_ADDR11,         /* GPIO_EMC_19 is configured as SEMC_ADDR11 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_20_SEMC_ADDR12,         /* GPIO_EMC_20 is configured as SEMC_ADDR12 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_21_SEMC_BA0,            /* GPIO_EMC_21 is configured as SEMC_BA0 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_22_SEMC_BA1,            /* GPIO_EMC_22 is configured as SEMC_BA1 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_23_SEMC_ADDR10,         /* GPIO_EMC_23 is configured as SEMC_ADDR10 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_24_SEMC_CAS,            /* GPIO_EMC_24 is configured as SEMC_CAS */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_25_SEMC_RAS,            /* GPIO_EMC_25 is configured as SEMC_RAS */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_26_SEMC_CLK,            /* GPIO_EMC_26 is configured as SEMC_CLK */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_27_SEMC_CKE,            /* GPIO_EMC_27 is configured as SEMC_CKE */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_28_SEMC_WE,             /* GPIO_EMC_28 is configured as SEMC_WE */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_29_SEMC_CS0,            /* GPIO_EMC_29 is configured as SEMC_CS0 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_30_SEMC_DATA08,         /* GPIO_EMC_30 is configured as SEMC_DATA08 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_31_SEMC_DATA09,         /* GPIO_EMC_31 is configured as SEMC_DATA09 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_32_SEMC_DATA10,         /* GPIO_EMC_32 is configured as SEMC_DATA10 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_33_SEMC_DATA11,         /* GPIO_EMC_33 is configured as SEMC_DATA11 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_34_SEMC_DATA12,         /* GPIO_EMC_34 is configured as SEMC_DATA12 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_35_SEMC_DATA13,         /* GPIO_EMC_35 is configured as SEMC_DATA13 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_36_SEMC_DATA14,         /* GPIO_EMC_36 is configured as SEMC_DATA14 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_37_SEMC_DATA15,         /* GPIO_EMC_37 is configured as SEMC_DATA15 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_38_SEMC_DM01,           /* GPIO_EMC_38 is configured as SEMC_DM01 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_39_SEMC_DQS,            /* GPIO_EMC_39 is configured as SEMC_DQS */
        1U );                                   /* Software Input On Field: Force input path of pad GPIO_EMC_39 */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_40_SEMC_RDY,            /* GPIO_EMC_40 is configured as SEMC_RDY */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux (
        IOMUXC_GPIO_EMC_41_SEMC_CSX00,          /* GPIO_EMC_41 is configured as SEMC_CSX00 */
        0U );                                   /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_00_SEMC_DATA00,         /* GPIO_EMC_00 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_01_SEMC_DATA01,         /* GPIO_EMC_01 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_02_SEMC_DATA02,         /* GPIO_EMC_02 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_03_SEMC_DATA03,         /* GPIO_EMC_03 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_04_SEMC_DATA04,         /* GPIO_EMC_04 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_05_SEMC_DATA05,         /* GPIO_EMC_05 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_06_SEMC_DATA06,         /* GPIO_EMC_06 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig (
        IOMUXC_GPIO_EMC_07_SEMC_DATA07,         /* GPIO_EMC_07 PAD functional properties : */
        0x0110F9u );                             /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/7
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
